Repository: appsembler/xblock-grade-fetcher
Catalog: gradefetcher/translations/*/LC_MESSAGES/text.po
Languages: ar

source: Passed
ar: ناجح

source: Failed
ar: راسب

source: Assignment
ar: المهمة

source: Assignment {assignment_id}: <b>Passed</b>
ar: المهمة {assignment_id}: <b>ناجح</b>

source: Assignment {assignment_id}: <b>Failed</b> - {reason_api_text}
ar: المهمة {assignment_id}: <b>راسب</b> - {reason_api_text}

source: Assignment {assignment_id}: - {reason_api_text}
ar: المهمة {assignment_id}: - {reason_api_text}

source: You got {grade} score for this activity. Explanation: {reasons_msg}
ar: حصلت على {grade} في هذا النشاط. الشرح: {reasons_msg}

source: Assignment {assignment_id}: Failed
ar: المهمة {assignment_id}: راسب

source: We cannot find your account on Customization. Please make sure that you have created your account. If you need assistance, please contact the course team.
ar: لا نستطيع العثور على حسابك في التخصيص. الرجاء التأكد من إنشاء حسابك. إذا كنت بحاجة إلى مساعدة، يرجى الاتصال بفريق الدورة.

source: Something went wrong please try again.
ar: حدث خطأ ما، الرجاء المحاولة مرة أخرى.

source: Loading
ar: جاري التحميل

source: You got
ar: حصلت على

source: score for this activity.
ar: في هذا النشاط.

source: Explanation:
ar: الشرح:

source: Click on the %(button_text)s button to see your score.
ar: انقر على زر %(button_text)s لرؤية درجتك.

source: You got <span class='grade'>{grade}% </span> score for this activity.<br />Explanation: <span class='reason'><ul>{reasons_msg}</ul></span>
ar: لقد حصلت على <span class='grade'>{grade}% </span> درجة في هذا النشاط.<br />الشرح: <span class='reason'><ul>{reasons_msg}</ul></span>

source: button to see your score.
ar: زر لرؤية درجتك.

source: It seems that one of your data element groups is not assigned to a data element group set. Note: This does not affect your grade.
ar: يبدو أن أحد مجموعات عناصر البيانات لديك غير مخصص لمجموعة مجموعات عناصر البيانات. ملاحظة: هذا لا يؤثر على درجتك.

source: It seems that you have not created data elements yet. Note: This does not affect your grade, but it is preventing you from completing this set of assignments.
ar: يبدو أنك لم تقم بإنشاء عناصر بيانات بعد. ملاحظة: هذا لا يؤثر على درجتك، لكنه يمنعك من إكمال هذه المجموعة من المهام.

source: It seems that you have not created all of the three requested data element groups. Note: This does not affect your grade.
ar: يبدو أنك لم تقم بإنشاء كل المجموعات الثلاث المطلوبة لعناصر البيانات. ملاحظة: هذا لا يؤثر على درجتك.

source: It seems that you have not assigned one or more of your data elements to your data element groups. Note: This does not affect your grade.
ar: يبدو أنك لم تخصص واحدًا أو أكثر من عناصر البيانات لديك إلى مجموعات عناصر البيانات الخاصة بك. ملاحظة: هذا لا يؤثر على درجتك.

source: It seems that you have not created the six data elements as requested. Note: This does not affect your grade
ar: يبدو أنك لم تقم بإنشاء الستة عناصر البيانات كما طلب. ملاحظة: هذا لا يؤثر على درجتك

source: It seems that no data set is currently assigned to your account. Please contact the course team.
ar: يبدو أنه لم يتم تخصيص أي مجموعة بيانات حاليًا لحسابك. يرجى التواصل مع فريق الدورة التدريبية.

source: It seems that no data has been entered in your data set.
ar: يبدو أنه لم يتم إدخال أي بيانات في مجموعة البيانات الخاصة بك.

source: It seems that you have not created all of the four requested organisation unit groups. Note: This does not affect your grade.
ar: يبدو أنك لم تقم بإنشاء كل الأربع مجموعات وحدات التنظيم المطلوبة. ملاحظة: هذا لا يؤثر على درجتك.

source: It seems that you have not created the requested two organisation unit group sets. Note: This does not affect your grade.
ar: يبدو أنك لم تقم بإنشاء المجموعتين المطلوبتين لمجموعات وحدات التنظيم. ملاحظة: هذا لا يؤثر على درجتك.

source: ERROR: We cannot find your account on Customization. Please make sure that you have created your account. If you need assistance, please contact the course team.
ar: خطأ: لا يمكننا العثور على حسابك في التخصيص. يرجى التأكد من أنك قد أنشأت حسابك. إذا كنت بحاجة إلى مساعدة، يرجى التواصل مع فريق الدورة التدريبية.

source: ERROR: Two or more Root Organisation Units have been assigned to your account. This is preventing us from assessing your assignments. Please contact the course team.
ar: خطأ: تم تخصيص وحدتين تنظيميتين جذريتين أو أكثر لحسابك. هذا يمنعنا من تقييم مهامك. يرجى التواصل مع فريق الدورة التدريبية.

source: It seems that you have not yet assigned your data elements to your data set, therefore you can't enter data. Check that data elements are assigned to the data set that was created for you.
ar: يبدو أنك لم تخصص عناصر البيانات الخاصة بك لمجموعة البيانات الخاصة بك بعد، وبالتالي لا يمكنك إدخال البيانات. تحقق من أن عناصر البيانات مخصصة لمجموعة البيانات التي تم إنشاؤها لك.

source: It seems that you have created none of the requested organisation units.
ar: يبدو أنك لم تقم بإنشاء أي من وحدات التنظيم المطلوبة.

source: It seems that your data set is not yet assigned to any organisation units.
ar: يبدو أن مجموعة البيانات الخاصة بك لم يتم تخصيصها بعد لأي وحدات تنظيمية.

source: User did not create any Facility-level Org Units.
ar: المستخدم لم يقم بإنشاء أي وحدات تنظيمية على مستوى المنشأة.

source: We could not find your Malaria program. Please make sure that the program that you want to be graded has the word 'Malaria' in its name.
ar: لم نتمكن من العثور على برنامج الملاريا الخاص بك. يرجى التأكد من أن البرنامج الذي تريد تقييمه يحتوي على كلمة 'ملاريا' في اسمه.

source: It seems that you have not assigned an organisation unit to your Malaria program.
ar: يبدو أنك لم تخصص وحدة تنظيمية لبرنامج الملاريا الخاص بك.

source: It seems that you have not assigned one or more of your data elements to your Malaria program.
ar: يبدو أنك لم تقم بتعيين واحد أو أكثر من عناصر البيانات الخاصة بك إلى برنامج الملاريا الخاص بك.

source: It seems that you have not created an option set for your data elements that have been assigned to your Malaria program.
ar: يبدو أنك لم تقم بإنشاء مجموعة خيارات لعناصر البيانات التي تم تعيينها إلى برنامج الملاريا الخاص بك.

source: It seems that you have not created options for your option set.
ar: يبدو أنك لم تقم بإنشاء خيارات لمجموعة الخيارات الخاصة بك.

source: It seems like your program's data elements are not added to groups, or they are not of the Tracker type.
ar: يبدو أن عناصر البيانات الخاصة ببرنامجك لم تتم إضافتها إلى مجموعات، أو أنها ليست من نوع Tracker.

source: It seems you have not created a section form for your Malaria program.
ar: يبدو أنك لم تقم بإنشاء نموذج قسم لبرنامج الملاريا الخاص بك.

source: It seems you have not assigned your user access to your Malaria program. Please check the sharing settings for your program and that you have access to both data and metadata.
ar: يبدو أنك لم تقم بتخصيص وصول المستخدم الخاص بك إلى برنامج الملاريا. الرجاء التحقق من إعدادات المشاركة لبرنامجك وأن لديك الوصول إلى كل من البيانات والميتاداتا.

source: It seems that you have not created an event or have not entered any data into it for your Malaria program.
ar: يبدو أنك لم تقم بإنشاء حدث أو لم تدخل أي بيانات فيه لبرنامج الملاريا الخاص بك.
